[
  {
    "innerHtml": "GitHub Repository: <a href=\"https://github.com/GriffinBaxter/Calendar-Notes\" rel=\"noreferrer noopener\">Github.com/GriffinBaxter/Calendar-Notes</a>",
    "tagName": "p"
  },
  {
    "innerHtml": "This Android notetaking app, Calendar Notes, was created in Kotlin for one of my University courses, <a href=\"https://www.canterbury.ac.nz/courseinfo/GetCourseDetails.aspx?course=SENG440&occurrence=22S2(C)&year=2022\" rel=\"noreferrer noopener\">SENG 440 (Special Topic: Topics in Mobile Computing)</a>, during Semester 2 of 2022. The project itself received an A (87%) grade for the course.",
    "tagName": "p"
  },
  {
    "innerHtml": "I chose to create this app based on my note-taking habits. I usually make use of Google Keep, which unfortunately has many limitations (unable to add dates/times to portions of notes, and unable to differentiate between due dates or events, etc). Calendar Notes allows for users to create different types of notes, including “due date” and “event” based notes, which allows for a date or a period within a day to be attributed with each section of the note. Sections can be added to each note which allows for due dates or events to show up in the day-by-day calendar.",
    "tagName": "p"
  },
  {
    "innerHtml": "XML was used for declaratively creating the user interface, primarily due to the fact that Jetpack Compose was relatively new and not as well established. I also made use of a “Single Activity-Multiple Fragment” architecture for the navigation of the app, to allow for easy navigation using a nav graph. The app also makes use of implicit intents for sharing notes, RecyclerViews, French translation, <a rel=\"noreferrer noopener\" href=\"https://date.nager.at/Api\">public holiday API</a> with coroutines, animations, data persistence, <a rel=\"noreferrer noopener\" href=\"https://developer.android.com/develop/ui/views/launch/shortcuts\">static and dynamic shortcuts</a>, and supports both landscape and portrait orientations.",
    "tagName": "p"
  },
  {
    "innerHtml": "",
    "tagName": "hr"
  },
  {
    "innerHtml": "Gallery",
    "tagName": "h4"
  },
  {
    "innerHtml": "1n9pLKr03ujEnIwvgw9YvyVGqDRlmenkA2oW5Jit8j3CBKO9",
    "tagName": "figure"
  },
  {
    "innerHtml": "1n9pLKr03ujEfYTj0W17Il1Bp64VyzWZOSEg0m9GAvdJCLKs",
    "tagName": "figure"
  },
  {
    "innerHtml": "1n9pLKr03ujEIPKHBFgJGWpaxSKbT1Y50h6dMLrZDCmXjws8",
    "tagName": "figure"
  },
  {
    "innerHtml": "1n9pLKr03ujEmJUliyX9OhySa5fI0ZbcEvT8GdieRksANW6M",
    "tagName": "figure"
  },
  {
    "innerHtml": "1n9pLKr03ujEJIPJ3dYhi3UTJlNFqgsKojZEMAukV41BLO9X",
    "tagName": "figure"
  },
  {
    "innerHtml": "1n9pLKr03ujEPyk5hCl4FETeBcqaXb1yW9pOsUjmCiVLxKIt",
    "tagName": "figure"
  }
]
