[
  {
    "innerHtml": "The original Life is Strange is one of my favourite games of all time, but does the sequel hold up? Surprisingly, I think it does, but in a different way than the first game did. Life is Strange 2 is similar in many ways to the first game (and of course the spin-off, Before the Storm), with the main differentiating factor being the gameplay, due to some newly added mechanics that add variety to the game.",
    "tagName": "p"
  },
  {
    "innerHtml": "One of the new mechanics is the time-constrained talking options while walking around. This adds to the natural flow of conversation with added interactivity. In the first Life is Strange game, there were usually no dialogue options whilst walking around the game world. Another addition was the supplementary choices for many situations and the longstanding effects of which. There was even a situation in which a major choice had three options, instead of the usual two. The new drawing mechanic allowed for a more interactive version of the ‘sitting with music’ sections, although, that isn’t to say that they weren’t prevalent in this game as well. It can be a bit of a useless mechanic having to wave around the mouse for a drawing to finish, however, it’s a good way to show the progression of a drawing, similar to the interactivity found within Quantic Dream games.",
    "tagName": "p"
  },
  {
    "innerHtml": "LiS2 Screenshot 2.png",
    "tagName": "figure"
  },
  {
    "innerHtml": "The main character of the game, Daniel Diaz, is realistically written and portrayed for the circumstances he is in throughout the game’s journey. His voice actor, Gonzalo Martin, even <a href=\"https://www.reddit.com/r/lifeisstrange/comments/dv8ybc/all_im_gonzalo_martin_voice_actor_of_sean_diaz_in/f7bwqr3/\">slept on the street as research for the role to create a more believable performance</a>. On the point of the characters, each episode features a different assortment of people with new locations showcased in each episode.  This allowed for a large variety of people’s stories to be told, facilitating the ability to learn more about the main characters by their interactions and dialogue with others and their surroundings.",
    "tagName": "p"
  },
  {
    "innerHtml": "Every episode was extremely engaging and I completed many of the episodes on their release day and sometimes even in one sitting. The length of each episode and the entire game overall does not drag on despite their extended length compared to previous Life is Strange games. I ended up with an average of close to five hours spent per episode, however, I must add that I did take a leisurely approach to my playthrough in order to enjoy as much of the game as possible. This included going through all of the well-written and realistically drawn journal entries and finding collectibles.",
    "tagName": "p"
  },
  {
    "innerHtml": "LiS2 Screenshot 3.png",
    "tagName": "figure"
  },
  {
    "innerHtml": "Episodes one and two were the set up for some of the best episodes in all of Life is Strange, the following episodes three, four and five. The first episode is a great introduction which sets the scene for the entire game. The second episode builds off the first, with the introduction of more characters and is arguably the calmest section of the game. The third episode is when the game suddenly escapes the introduction phase with brilliant characters, story progression and great moments scattered throughout. The fourth and fifth episodes build on this momentum created by the third episode with enthralling and exciting characters and surroundings. The last few episodes make the first couple of episodes well worth their ‘set-up’ period. My favourite episodes of the game ranking from best to worst would go Episode 5: Wolves, Episode 4: Faith, Episode 3: Wastelands, Episode 1: Roads and Episode 2: Rules.",
    "tagName": "p"
  },
  {
    "innerHtml": "The game has an impressive four distinct endings (seven if you count all the different variations) which are all well thought out and account for the decisions made throughout. This was made possible by the morality and brotherhood systems incorporated into the game. These systems are well designed and allow for most of the choices made in-game to influence various situations, which is a step-up from the first game. On the topic of the first game, there were some references to it throughout the game. Thankfully, Dontnod didn’t go overboard with these references and thus, the original Life is Strange is not required to be played as a prerequisite to this game.",
    "tagName": "p"
  },
  {
    "innerHtml": "LiS2 Screenshot 4.png",
    "tagName": "figure"
  },
  {
    "innerHtml": "The locations featured are visually brilliant alongside the game’s tasteful art style and accompanying vivid environment, with the highlight being the game’s lighting. This art style looks distinct from the first season of the series and gives the game its original look, which looks brilliant in this Unreal Engine 4 title. The cutscenes are expertly crafted, with the cinematography highlights being the in the game’s various intense scenes and situations.",
    "tagName": "p"
  },
  {
    "innerHtml": "The game features lots of great music, with many original and licensed tracks. The original soundtrack by Jonathan Morali (creator of the first game’s original soundtrack) is great. The main original theme is brilliant and variations of it are used throughout many of the game’s tracks. The licensed tracks were also great in typical Life is Strange fashion, with my favourites being D.A.N.C.E. by Justice and Natalie by Milk &amp; Bone. The variation in the music in terms of its use was great, whereas there are episodes which only use original tracks and some lean heavily into the licensed tunes.",
    "tagName": "p"
  },
  {
    "innerHtml": "LiS2 Screenshot 5.png",
    "tagName": "figure"
  },
  {
    "innerHtml": "Overall the game is brilliant and tells and a great story, through the course of a five-chapter adventure. The main characters are relatable and accurate, which makes the player think through the options and choices that the game presents. Due to the game’s ability to keep me so entertained and enthralled without missing a beat, I have no other option than to classify this as a top-tier game. I can now only hope that Dontnod makes a Life is Strange 3. Or, at least, another game in a similar vein.",
    "tagName": "p"
  },
  {
    "innerHtml": "Rating: 10/10",
    "tagName": "h4",
    "attributes": [
      {
        "name": "textAlign",
        "value": "center"
      }
    ]
  },
  {
    "innerHtml": "",
    "tagName": "hr"
  },
  {
    "innerHtml": "Review Info",
    "tagName": "h4"
  },
  {
    "innerHtml": "<strong>Platform:</strong> PC (Steam)",
    "tagName": "p"
  },
  {
    "innerHtml": "<strong>Game Start Date:</strong> 28 September 2018",
    "tagName": "p"
  },
  {
    "innerHtml": "<strong>Game Completion Date:</strong> 4 December 2019 (All five episodes completed)",
    "tagName": "p"
  }
]
