{
  "blocks": [
    {
      "innerHtml": "The first moments of Red Dead Redemption 2 were familiar, in the sense that it follows the typical Rockstar game formula, with missions that most closely resemble the game mechanics of Grand Theft Auto V, their previous major release. Rockstar’s signature mission structure has not changed too much, however, I think that’s a good thing. The missions are linear, cinematic, action-packed adventures, which are the stand-out main attraction of the game. Excellent dialogue and overall acting performances are heavily shown off in all the missions throughout the game, as typical from a Rockstar production. The game tends to closely resemble an interactive movie experience compared to the average video game, which I believe captures the brilliance of both the film and video game mediums in this instance.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        },
        {
          "name": "fontSize",
          "value": "normal"
        }
      ]
    },
    {
      "innerHtml": "A welcome surprise was to also see major efforts put into the various side ‘stranger’ missions as well. I even found some of the side missions to be more interesting than some of the main story points. It’s a disservice to call them side missions because of this, due to the typical nature of subpar side missions in most triple-A games, such as the average Ubisoft game in which side missions (and which may be a controversial statement, applies to their main story missions as well) are tacked-on, copy and paste, dull missions which are a waste of time if the story missions are significantly more entertaining. Red Dead Redemption 2 essentially had an extended storyline with these stranger missions, which are created in the way that they might as well be part of the main story. That isn’t to say all of them are great, just that most of them are a create a great change of pace from the main mission and in typical Rockstar fashion, showcase political references, stereotypes and overall just interesting characters with full cutscenes and mission structures.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "RDR2 Screenshot 2.png",
      "tagName": "figure",
      "attributes": [
        {
          "name": "align",
          "value": "wide"
        },
        {
          "name": "id",
          "value": "172"
        },
        {
          "name": "sizeSlug",
          "value": "full"
        }
      ]
    },
    {
      "innerHtml": "The subtle nature of the comedic and political references in Red Dead Redemption 2 is a refreshing change from Rockstar’s Grand Theft Auto series. This isn’t to say that either style is necessarily better than the other, rather that they are contrasting styles when compared to one another. This adds to the serious nature of the game’s theme and story, without having to take away Rockstar’s top-tier satire. This creates an arguably greater impact in terms of the game’s comedic dialogue. I’m glad that in such a serious game that Rockstar wasn’t scared away from creating memorable comedic moments out of the dialogue for its accompanying characters.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "The dialogue in the game is brilliant and is never a bore to listen to when travelling to and from objectives, as per usual Rockstar fashion. The best performance and dialogue, in my opinion, goes to Dutch van der Linde, leader of the gang with his believable dialogue with the perfect number of comedic elements and a strong sense of character. Rockstar has created a convincing experience of being part of a group, with everyone character’s differentiating quirks in the Van der Linde gang. This allows a different experience in every conversation, in which everyone interacts with each member of the gang differently. The game has exceptional use of dialogue, various interactivity options with each individual of the gang and every character’s individual but more importantly, interesting stories.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "RDR2 Screenshot 3.png",
      "tagName": "figure",
      "attributes": [
        {
          "name": "align",
          "value": "wide"
        },
        {
          "name": "id",
          "value": "503"
        },
        {
          "name": "sizeSlug",
          "value": "full"
        }
      ]
    },
    {
      "innerHtml": "The game is packed with detail and throughout my playthrough, it seemed obvious as to why the game took such a lengthy development cycle. It wasn’t a surprise to find out that during the game’s production, <a href=\"https://www.vulture.com/2018/10/the-making-of-rockstar-games-red-dead-redemption-2.html\">Rockstar was, in terms of numbers, the biggest employer of actors of anyone in New York by a long shot</a>. The amount of detail in the game is comparably unfair to other games due to the time and budget spent on the production. This is shown throughout the game with the large magnitude of dialogue, fully-fledged cutscenes featuring many characters to interact with in various locations, many of which being optional to the main story.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "While the game does like to utilise realism to create an immersive experience, that isn’t to say that all the detail presented in the game was put to good use as there are a few elements of this nature that can lead to some frustrations. I believe that there was a lot of wasted detail, that others may appreciate, but I thought that it did not add to the game. From egregiously long looting animations to mechanics requiring the player to tediously clean their weapons to maintain their stats, there are a lot of quality-of-life sacrifices of which make for minimal to no enhancement to the game’s presentation. The game also features a large number of compendium items and many uninteresting collectibles, which appear to be a large amount of effort gone to waste. The game also features crafting mechanics that are seemingly unnecessary due to the game’s relatively easy difficulty.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "RDR2 Screenshot 4.png",
      "tagName": "figure",
      "attributes": [
        {
          "name": "align",
          "value": "wide"
        },
        {
          "name": "id",
          "value": "174"
        },
        {
          "name": "sizeSlug",
          "value": "full"
        }
      ]
    },
    {
      "innerHtml": "On the topic of the game’s difficulty, I do believe that many games don’t require different difficulty options and that an optimised difficulty can suffice. However, I believe, in this case, the game has been made too easy due to the many game mechanics that allow significant advantages during the gameplay, such as the abundant amount of tonics, healer items and the generous amount of time to utilise the ‘dead eye’ ability, allowing multiple targets to be aimed at and killed in slow motion. A harder difficulty may increase its value, or an option to be able to choose, however, may have created a less overall balanced game.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "The game’s soundtrack is brilliant, with the highlights being the tracks made specifically for certain missions. However, I believe that the game’s music should have been shown off more often. It features many brilliant tracks that could have been used more often throughout the game’s story, however, the impact each time the soundtrack was used was great and thus, the sparse use of its exceptional tracks added to the thematic impact in these sections.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "RDR2 Screenshot 5.png",
      "tagName": "figure",
      "attributes": [
        {
          "name": "align",
          "value": "wide"
        },
        {
          "name": "id",
          "value": "175"
        },
        {
          "name": "sizeSlug",
          "value": "full"
        }
      ]
    },
    {
      "innerHtml": "I think the length of the game is good and it never occurred to me as being too long or drawn out, even though it is a 50-hour long campaign. In terms of the game’s aesthetic, there isn’t too much to say. It is a stunning game with brilliant graphics and an amazing atmosphere which looks outstanding on PC with framerates surpassing 60 frames per second.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "The game has displayed the occasional noticeable bug or glitch, however, none of which I encountered had been game-breaking or reoccurring enough to be a nuisance. This is apart from the crashing issues I had near launch, of which have not occurred again due to patches from Rockstar. These inconsistencies were however notable enough to mention, of which the most common type observed were visual glitches.",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "RDR2 Screenshot 6.png",
      "tagName": "figure",
      "attributes": [
        {
          "name": "align",
          "value": "wide"
        },
        {
          "name": "id",
          "value": "176"
        },
        {
          "name": "sizeSlug",
          "value": "full"
        }
      ]
    },
    {
      "innerHtml": "I believe Rockstar has hidden this game’s 10/10 potential by trying to create the ‘perfect’ game. Instead, they have buried it with some egregious immersive elements that ultimately bog down the game. Rockstar’s obsession with details and trying to create the perfect immersive experience has unfortunately gone too far in certain scenarios. However, overall, this game is a cinematic masterpiece with a huge amount of content and apparent budget put into it, in which a large majority of it has gone to good use, with only the aforementioned points being the main problems bogging the game down. I had not played the original Red Dead Redemption, due to its release on consoles that I don’t own. However, the previous game is not necessary to play as Red Dead Redemption 2 is a prequel to the original from 2010. It’s also notable to say that it did take me a fair while to get properly engaged in the game’s atmosphere and story. Nevertheless, at around the third chapter of the main story, I became fully invested in the game and was right through to the very end of the game when the epilogue was finished.",
      "tagName": "p",
      "attributes": [
        {
          "name": "align",
          "value": "justify"
        }
      ]
    },
    {
      "innerHtml": "Rating: 9/10",
      "tagName": "h4",
      "attributes": [
        {
          "name": "textAlign",
          "value": "center"
        },
        {
          "name": "level",
          "value": "4"
        }
      ]
    },
    {
      "innerHtml": "",
      "tagName": "hr",
      "attributes": [
        {
          "name": "className",
          "value": "is-style-wide"
        }
      ]
    },
    {
      "innerHtml": "Review Info",
      "tagName": "h4",
      "attributes": [
        {
          "name": "level",
          "value": "4"
        }
      ]
    },
    {
      "innerHtml": "The developer/publisher did not provide a review sample of this game.",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "<strong>Game Info:</strong>",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "Name: Red Dead Redemption 2",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "Developer: Rockstar Games",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "Publisher: Rockstar Games",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "<strong>Platform:</strong> PC (Rockstar Games Launcher)",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "<strong>Review PC Specs:</strong>",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "CPU: Intel i7-8700",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "GPU: Nvidia GTX 1070",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "Memory: 16GB DDR4 2666MHz",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "Monitor: 1440p 165Hz IPS G-Sync 27”",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "Game Storage: NVME SSD",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "<strong>Game Start Date:</strong> 6 November 2019",
      "tagName": "p",
      "attributes": []
    },
    {
      "innerHtml": "<strong>Game Completion Date:</strong> 30 December 2019 (Main Chapters and Epilogue completed)",
      "tagName": "p",
      "attributes": []
    }
  ],
  "title": "Red Dead Redemption 2",
  "categories": {
    "nodes": [
      {
        "name": "Game Reviews",
        "slug": "game-reviews"
      }
    ]
  },
  "excerpt": "Single-player Review",
  "featuredImage": {
    "node": {
      "sourceUrl": "RDR2 Screenshot 1.png"
    }
  },
  "date": "2020-01-25T14:00:13"
}
